[{"id":1,"title":"Check in to Open Source Week","description":"Make sure you're registered and Checked-in to Open Source Week to stay in the loop with everything happening!","link":"https://mlh.link/ghw","completed":true},{"id":2,"title":"Signup for the GitHub Student Developer Pack","description":"Grab the GitHub Student Developer Pack as you get hacking this week!","link":"https://mlh.link/ghwos24-github","completed":false},{"id":3,"title":"Register with DigitalOcean","description":"Begin your journey by registering for DigitalOcean! Share a screenshot of your account signup page on mlh.link/GHWForm","link":"https://mlh.link/ghwos24-digitalocean-challenge1","completed":false},{"id":4,"title":"Signup for a TinyMCE account","description":"Signup for a TinyMCE account and share a screenshot to our submission form","link":"https://mlh.link/ghwos24-tinymce-signup","completed":true},{"id":5,"title":"Join the LavinMQ Slack","description":"Join the LavinMQ Slack and give our projects a star on GitHub. Join the LavinMQ Slack and ask any Hackathon-related questions in the `#global-hack-week` channel. Don’t forget to give Crystal and LavinMQ a star on GitHub! Share a screenshot on mlh.link/GHWForm to earn points!","link":"https://mlh.link/ghwos24-lavinmq","completed":true},{"id":6,"title":"1-Click Deploy","description":"Deploy a Go/Node.js/Python sample with 1-click Deploy from the Defang homepage (https://defang.io/samples/). This will require your GitHub credentials. Share a screenshot of your deployed application on mlh.link/GHWForm!","link":"https://mlh.link/ghwos24-defang-challenge1","completed":true},{"id":7,"title":"Star the GitHub Green Software Repo","description":"Check out the GitHub Green Software repo and give it a star! Share a screenshot of the starred repo on our submission form!","link":"https://mlh.link/ghwos24-githubsustainability-challenge2","completed":true},{"id":8,"title":"Create an Auth0 Account","description":"Navigate to auth0.com and create your own account! Share a screenshot of your deployed application on our submission form!","link":"https://mlh.link/ghwos24-auth0-challenge1","completed":true},{"id":9,"title":"Sign up and download 23ai VirtualBox","description":"Head over to the VirtualBox signup page to get set up with a new account. Share a screenshot on our submission form.","link":"https://mlh.link/ghwos24-oracle-registration1","completed":false},{"id":10,"title":"Create an account and Sign in for LiveLabs","description":"Create a  LiveLabs account  so you can leverage Oracle’s LiveLab tutorials. Share a screenshot on our submission form.","link":"https://mlh.link/ghwos24-oracle-registration2","completed":true},{"id":11,"title":"Join the MLH Discord","description":"Join us at discord.mlh.io to keep in touch throughout the week.","link":"https://discord.mlh.io","completed":true},{"id":12,"title":"Fill out our Address Form","description":"We want to send you swag! Fill out mlh.link/Address so where know where to ship the awesome swag you'll earn this week","link":"https://mlh.link/address","completed":true},{"id":13,"title":"Follow MLH on Instagram","description":"Follow MLH on Instagram to keep up to date with hacker events! Share a screenshot of your follow on mlh.link/GHWForm","link":"https://instagram.com/mlhacks","completed":false},{"id":14,"title":"Follow MLH on Twitter","description":"Follow MLH on Twitter to keep up to date with hacker events! Share a screenshot of your follow on mlh.link/GHWForm","link":"https://mlh.link/GHWForm","completed":true},{"id":15,"title":"Share your MLH Sticker Swag","description":"Share a photo of your MLH Sticker Swag with #GlobalHackWeek and @MLHacks. Link your post on mlh.link/GHWForm to earn points.","link":"https://mlh.link/GHWForm","completed":false},{"id":16,"title":"Refer a friend to GHW","description":"Send a friend to GHW and get enter into a swag raffle by using our referral form! Share their email on mlh.link/GHWForm","link":"https://majorleaguehacking.typeform.com/to/nFXeE5HQ","completed":true},{"id":17,"title":"Register for Career Week","description":"Join us in November for a week of all things Career!","link":"https://ghw.mlh.io/events/career-week","completed":true},{"id":18,"title":"Make a Video About Global Hack Week","description":"Create your own TikTok/Vertical Video about GHW. Submit a link on mlh.link/GHWForm.","link":"https://mlh.link/GHWForm","completed":false},{"id":19,"title":"Register for Data Week","description":"Join us in December for a week of all things Data!","link":"https://ghw.mlh.io/events/cloud","completed":true},{"id":20,"title":"Share your Experience","description":"Tag us on Twitter or LinkedIn, and let us know what you've enjoyed about Global Hack Week so far! Send a link to your post on mlh.link/GHWForms","link":"https://mlh.link/GHWForm","completed":true},{"id":21,"title":"Create an Open Source Tool or Library","description":"Today we're challenging you to develop a useful tool or library and release it as an open source project. Share your project on mlh.link/Devpost","link":"https://mlh.link/ghwdevpost","completed":false},{"id":22,"title":"Open Source Advocacy","description":"Help promote open source software and its benefits through a blog or a tweet! Share a link to what you wrote on mlh.link/GHWForm","link":"https://mlh.link/GHWForm","completed":true},{"id":23,"title":"Follow MLH on LinkedIn","description":"Follow MLH on LinkedIn to keep up to date with hacker events! Share a screenshot of your follow on mlh.link/GHWForm","link":"https://mlh.link/GHWForm","completed":true},{"id":24,"title":"Integrate an Open Source Project","description":"Use any open source project of your choice in your hack. Don’t forget to mention the project on Devpost when you submit at mlh.link/GHWDevpost","link":"https://mlh.link/ghwdevpost","completed":false},{"id":25,"title":"Open Source Data","description":"Use an open source data set to create a data visualization or train an AI model! Share what you built on mlh.link/GHWDevpost","link":"https://mlh.link/ghwdevpost","completed":false},{"id":26,"title":"README Challenge","description":"Add an informative readme to an older hackathon project or for one that you are working on right now and share it with us on mlh.link/GHWForm.","link":"https://www.makeareadme.com/","completed":false},{"id":27,"title":"Profile README","description":"Create an informative profile readme for yourself and share it with us on  mlh.link/GHWForm. Help doc - https://dev.to/github/how-to-create-a-github-profile-readme-jha","link":"https://dev.to/github/how-to-create-a-github-profile-readme-jha","completed":false},{"id":28,"title":"Unit Tests","description":"Find an Open Source project that lacks sufficient unit tests. Submit a pull request to add unit tests for a specific module or function. Share what you added on mlh.link/GHWDevpost","link":"https://mlh.link/ghwdevpost","completed":false},{"id":29,"title":"Contribute to Docs","description":"Great Open Souce projects start with great documentation. Contribute to the documentation on any Open Souce project and share what you added on mlh.link/GHWDevpost","link":"https://mlh.link/ghwdevpost","completed":false},{"id":30,"title":"User Support","description":"Did you know you can contribute to Open Source without writing a line of code? Join an Open Souce community forum and help answer someone's question. Share a screenshot on mlh.link/GHWForm.","link":"https://mlh.link/GHWForm","completed":false},{"id":31,"title":"Create a sticker for an Open Source Project","description":"Pick your favorite OS project and design a sticker! Share you design on mlh.link/ghwform","link":"https://mlh.link/GHWForm","completed":false},{"id":32,"title":"Use Speech to Text or Text to Speech","description":"Using Speech to Text and Text to Speech can help you create more inclusive applications. Implement one of these (or both) to earn these points. Submit on Devpost!","link":"https://mlh.link/GHWDevpost","completed":false},{"id":33,"title":"Hack with a public API","description":"Use any publically available API today and share your project on mlh.link/GHWDevpost.","link":"https://mlh.link/GHWDevpost","completed":false},{"id":34,"title":"Share memories from the last hackathon you attended!","description":"Tweet memories from the last hackathon you attended and share the link with us here.","link":"https://mlh.link/GHWForm","completed":false},{"id":35,"title":"Hack with Midnight","description":"Midnight is a data protection blockchain that offers programmable data protection capabilities powered by zero-knowledge technology to address the delicate balance between data protection, ownership, and utilization. This ensures that developers can leverage blockchain technology without exposing confidential information or losing control over their data.\n\n\nTo build on Midnight, all you need is familiarity with TypeScript or a similar JavaScript based library. The service is free to use and their developer documentation has all the information you need to get started. Get started here - https://mlh.link/midnight","link":"https://mlh.link/GHWDevpost","completed":false},{"id":36,"title":"Hack with Defang","description":"Defang is a radically simpler way to Develop, Deploy, and Debug hackathon projects, letting you go from idea to a cloud-deployed application in less than 5 minutes! Build your project in any language, deploy to the cloud with a single command and iterate seamlessly. The Defang CLI is compatible with Linux, MacOS, and Windows, making it a great solution regardless of your operating system.\n\nDownload it today for free and save countless stress-filled hours of trying to get your application up and running on the cloud. Get started here - https://mlh.link/defang","link":"https://mlh.link/GHWDevpost","completed":true},{"id":37,"title":"Hack with Databricks","description":"Databricks is an open analytics platform that helps you build, deploy, and maintain large scale data & AI solutions! Whether you’re working with large language models using Mosaic AI, storing data with Databricks Data Lakes, or deploying GenAI powered applications using MLflow, Databricks Open Source software has the tools you need to make your hackathon project state of the art. \n\n\nGet started here - https://mlh.link/databricks","link":"https://mlh.link/GHWDevpost","completed":false},{"id":38,"title":"Hack with Streamlit","description":"Want to take your Python skills to the next level? Streamlit is an open-source Python library that makes it easy to share and build custom web apps for machine learning, data science, and more. Instead of writing Python scripts without a UI, you can create a beautiful web app, complete with widgets and data visualizations, and deploy it for free to the Streamlit Community Cloud. You can even build a fully functional LLM-powered app with just 25 lines of code! Get started here - https://mlh.link/streamlit","link":"https://mlh.link/GHWDevpost","completed":false},{"id":39,"title":"Share your Setup","description":"Share a photo of your hacking setup on twitter with #GlobalHackWeek and @MLHacks! Link your post at mlh.link/GHWForm for points.","link":"https://mlh.link/GHWForm","completed":false},{"id":40,"title":"GitHub Copilot Primer","description":"Wondering how to get started with Codespaces? This Primer makes it easy by giving you the templates, videos and step-by-step resources you need to get you started running, testing, debugging and pushing code using this instant cloud developer environment.","link":"https://mlh.link/ghwos24-github-challenge1","completed":false},{"id":41,"title":"Use GitHub Copilot","description":"Sign up for the GitHub student developer pack to get free access to GitHub Copilot and use it to help you complete any of this week's coding-based challenges! Share your builds in a GitHub Discussion and our our Devpost page!","link":"https://mlh.link/ghwos24-github-challenge2","completed":false},{"id":42,"title":"Find & follow OS Projects","description":"Lists are a great way to keep all of your favorite GitHub Open Source projects organized.  Go to or create a GitHub account. Find topics and projects that are interesting to you using the Explore button. Star 5 open source projects so that you can follow along and learn from its contributors. Share a screenshot of your list on  mlh.link/GHWForm!","link":"https://mlh.link/ghwos24-github-challenge3","completed":false},{"id":43,"title":"Get an intro to Open Source","description":"Complete the Intro to Open Source course by OpenSauced to begin your journey in collaborative development. Share a screenshot of your completion screen on mlh.link/GHWForm","link":"https://mlh.link/ghwos24-github-challenge4","completed":false},{"id":44,"title":"Hack with an Open Source Tool","description":"There are so many incredible tools that you may not know are Open Source! Build any hack using an OS tool and share with us on mlh.link/GHWDevpost.","link":"https://mlh.link/ghwdevpost","completed":false},{"id":45,"title":"Low Code Contribution","description":"Find a typo or deadlink in an OS project from Good First Issues, open a Pull Request to get it updated. Share a link of the pull request to mlh.link/GHWForm","link":"https://mlh.link/ghwos24-github-challenge5","completed":false},{"id":46,"title":"Submitting an issue","description":"GitHub Issues are items you can create in a repository to plan, discuss and track work. Go to GitHub’s Good First Issues, select a project, review their contribution guide and submit your first issue! Share a link of your issue on mlh.link/GHWForm","link":"https://mlh.link/ghwos24-github-challenge6","completed":false},{"id":47,"title":"Start/Answer a Discussion","description":"GitHub Discussions is a collaborative communication forum for the community around an open source or internal project. Community members can ask and answer questions, share updates, have open-ended conversations, and follow along on decisions affecting the community's way of working. Start your own Open Source discussion or contribute to an existing one! Share a link of your Open Source discussion on mlh.link/GHWForm","link":"https://mlh.link/ghwos24-github-challenge7","completed":false},{"id":48,"title":"Your first GitHub Action","description":"Build your first GitHub Actions workflow by completing the GitHub Actions Essentials Learning Path.\nShare a screenshot of your first GitHub Action on mlh.link/GHWForm","link":"https://mlh.link/ghwos24-github-challenge8","completed":false},{"id":49,"title":"Learn Vim","description":"Vim is a powerful open-source text editor. Learn it in a fun enviornment as you play the Vim adventures game. Share a screenshot of the level you reach at mlh.link/GHWForm.","link":"https://vim-adventures.com/","completed":false},{"id":50,"title":"Personal Access Token","description":"Get started with DigitalOcean’s APIs to carry out tasks listing your active offerings and creating new ones right from your terminal! Share your implementation with us on mlh.link/GHWDevpost","link":"https://mlh.link/ghwos24-digitalocean-challenge2","completed":false},{"id":51,"title":"Register your domain on DigitalOcean","description":"Adding a domain to your DigitalOcean account allows you to connect it effortlessly to your applications! Share your deployed domain on mlh.link/GHWForm","link":"https://mlh.link/ghwos24-digitalocean-challenge3","completed":false},{"id":52,"title":"Create a Static Site","description":"Creating a new static site is as simple as connecting a GitHub Repository to the DigitalOcean App Platform! Share your implementation with us on mlh.link/GHWDevpost","link":"https://mlh.link/ghwos24-digitalocean-challenge4","completed":false},{"id":53,"title":"Build your portfolio website","description":"Share a link to your portfolio website","link":"https://mlh.link/GHWForm","completed":false},{"id":54,"title":"Setup Monitoring on DigitalOcean App Platform","description":"Make sure you can observe your App Platform application’s performance and health by enabling monitoring in easy steps! Share your implementation with us on mlh.link/GHWDevpost","link":"https://mlh.link/ghwos24-digitalocean-challenge5","completed":false},{"id":55,"title":"Setup DigitalOcean Uptime for a website","description":"Get alerted when your assets are slow, down or vulnerable to attacks! Share your implementation with us on mlh.link/GHWDevpost","link":"https://mlh.link/ghwos24-digitalocean-challenge6","completed":false},{"id":56,"title":"1-Click Apps","description":"Get Started with 1-Click Apps on DigitalOcean Marketplace! Quickly launch popular frameworks, tools and services inside a Droplet with DigitalOcean Marketplace!Share your implementation with us on mlh.link/GHWDevpost","link":"https://mlh.link/ghwos24-digitalocean-challenge7","completed":false},{"id":57,"title":"TinyMCE Setup in 5","description":"Install and set up TinyMCE from scratch in a framework of your choice (React, Vue, Angular, or Vanilla JS).\nShare a screenshot of your TinyMCE setup in your project on our submission form and bonus points if you add your project to DevPost!","link":"https://mlh.link/ghwos24-tinymce-challenge1","completed":false},{"id":58,"title":"Enhance Your RTE","description":"Enhance Your RTE with Open Source Plugins. Choose and integrate two to three open-source plugins (e.g., Autolink, Full Screen, Table) to enhance your editor.Share your enhanced editor setup with us via our submission form and bonus points if you add your project to DevPost!","link":"https://mlh.link/ghwos24-tinymce-challenge2","completed":false},{"id":59,"title":"Level Up TinyMCE","description":"Choose between improving your editor’s Accessibility features or adding the Spellchecker plugin for error-free content. Share a screenshot or code snippet of your upgraded editor and bonus points if you add your project to DevPost!","link":"https://mlh.link/ghwos24-tinymce-challenge3","completed":false},{"id":60,"title":"Add Revision History","description":"Add the Revision History plugin to enable version control for your content, allowing users to track changes and revert to previous versions.\nShare your implementation with us on our submission form and bonus points if you add your project to DevPost!","link":"https://mlh.link/ghwos24-tinymce-challenge4","completed":false},{"id":61,"title":"Integrate AI Assistant","description":"Integrate AI Assistant with TinyMCE in 3 Steps. Choose from AI providers like OpenAI, Azure AI, AWS Bedrock, or Gemini and integrate AI Assistant capabilities into TinyMCE for smarter content creation.Submit your code and a demo of your AI-powered editor on our submission form and bonus points if you add your project to DevPost!","link":"https://mlh.link/ghwos24-tinymce-challenge5","completed":false},{"id":62,"title":"Crystal “Hello World”","description":"Install Crystal on your machine. Write a simple \"Hello, World!\" program in Crystal and run it. Check out Challenge 1 on the LavinMQ challenge page for more instructions and submit the hack to Devpost!","link":"https://mlh.link/ghwos24-lavinmq","completed":false},{"id":63,"title":"Crawl a web page","description":"Extend your Crystal program to fetch the HTML content of a web page and log it to the console.\nUse a fixed URL:  https://crystal-lang.org.\nCheck out Challenge 2 on the LavinMQ challenge page for more instructions and submit the hack to Devpost!","link":"https://mlh.link/ghwos24-lavinmq","completed":false},{"id":64,"title":"Custom URL Challenge","description":"Make the URL configurable at runtime. It should be passed as a command line argument to the program.\nIf the argument is missing you can either use a default value or produce an error.\nCheck out Challenge 3 on the LavinMQ challenge page for more instructions and submit the hack to Devpost!","link":"https://mlh.link/ghwos24-lavinmq","completed":false},{"id":65,"title":"Parse for Links","description":"Parse response body for links. Extend your web crawler in the previous challenge to parse the response body for links.Check out Challenge 4 on the LavinMQ challenge page for more instructions and submit the hack to Devpost!","link":"https://mlh.link/ghwos24-lavinmq","completed":false},{"id":66,"title":"LavinMQ producer","description":"Create a free LavinMQ instance and extend your previous Crystal program to connect to LavinMQ. \nCheck out Challenge 5 on the LavinMQ challenge page for more instructions and submit the hack to Devpost!","link":"https://mlh.link/ghwos24-lavinmq","completed":false},{"id":67,"title":"LavinMQ consumer","description":"Build a consumer program that reads URLs from the LavinMQ queue and logs them to the console.\nCheck out Challenge 6 on the LavinMQ challenge page for more instructions and submit the hack to Devpost!","link":"https://mlh.link/ghwos24-lavinmq","completed":false},{"id":68,"title":"LavinMQ Pattern Challenge","description":"Search for a pattern, Create a custom pattern, and conduct a fuzzy search. Wrap up your LavinMQ application written in Crystal Lang by updating your search functionality. Check out Challenge 7 on the LavinMQ challenge page for more instructions and submit the hack to Devpost!","link":"https://mlh.link/ghwos24-lavinmq","completed":false},{"id":69,"title":"Set up Defang CLI and Portal","description":"Download and install the Defang CLI from the Defang homepage (https://defang.io/#download) and register with Defang with your GitHub credentials using the \"defang login\" command (https://docs.defang.io/docs/cli/defang_login). Also login to the Defang Portal (https://portal.defang.dev/) with the same GitHub credentials.The sample app you deployed in Challenge 1 should be visible here. Share a screenshot on mlh.link/GHWForm!","link":"https://mlh.link/ghwos24-defang-challenge2","completed":false},{"id":70,"title":"Create a simple app with \"defang generate\"","description":"Defang supports generating new project outlines from a sample or using an AI model. Using this feature, you can describe what you would like the service to do and the CLI will generate a project outline with all the files required. Inspect the project source files and the Dockerfile and Compose file to ensure they are as expected. See: https://docs.defang.io/docs/tutorials/generate-new-code-using-ai for more details. Share a screenshot of your project outline on mlh.link/GHWForm!","link":"https://mlh.link/ghwos24-defang-challenge3","completed":false},{"id":71,"title":"Deploy a simple app to Defang Playground with \"defang compose up\"","description":"You can deploy the app you created in Challenge 3 to the Defang Playground environment with a single command: \"defang compose up\" (https://docs.defang.io/docs/cli/defang_compose_up). Verify the app is accessible on the Internet and test it. Inspect the app on the Defang Portal. If anything goes wrong, use the \"defang debug\" command to let the Defang AI assistant help you find and fix the issue. Share your code on our Devpost Page!","link":"https://mlh.link/ghwos24-defang-challenge4","completed":false},{"id":72,"title":"Advanced Challenge: Enhance your application with advanced features for compute and/or storage.","description":"Defang supports using GPUs in your applications - see https://docs.defang.io/docs/concepts/resources and https://docs.defang.io/docs/tutorials/deploy-with-gpu#aws-account-with-gpu-access \nDefang also supports specifying persistent storage services in your application (e.g. Redis, PostgreSQL) - see https://docs.defang.io/blog/june-2024-product-update#managed-redis\nUse one or both of these features to take your application to the next level. Share your code on our Devpost Page!","link":"https://mlh.link/ghwos24-defang-challenge5","completed":false},{"id":73,"title":"Attend a GitHub Sustainability talk and workshop","description":"Attend a GitHub Sustainability talk and workshop during Open Source Week. Share a screenshot of the livestream on our submission form!","link":"https://mlh.link/ghwos24-githubsustainability-challenge1","completed":false},{"id":74,"title":"Start a Green Software Project","description":"Find and star your favorite Green Software project. Share a screenshot of the starred repo on our submission form!","link":"https://mlh.link/ghwos24-githubsustainability-challenge3","completed":false},{"id":75,"title":"Take Climate Action!","description":"Find a way to reduce your code's carbon footprint. To help you get started, here's a list of GitHub's top 10 tools to \"green\" your software. Share your implementation with us on our Devpost Page!","link":"https://mlh.link/ghwos24-githubsustainability-challenge4","completed":false},{"id":76,"title":"Submit a pull request","description":"Submit a pull request to a Green Open Source Project! Share a link of your pull request on our submission form!","link":"https://mlh.link/ghwos24-githubsustainability-challenge5","completed":false},{"id":77,"title":"Star your favorite Auth0 Open Source Project","description":"Check out Auth0 Open Source Projects and star your favorite!\nShare a screenshot to our submission form!","link":"https://mlh.link/ghwos24-auth0-challenge2","completed":true},{"id":78,"title":"Set up social login through Google","description":"Follow this Google Social Connect guide which will allow you to implement social login with Google! Share your code on our Devpost Page!","link":"https://mlh.link/ghwos24-auth0-challenge3","completed":false},{"id":79,"title":"Customize your login box","description":"Follow Auth0's step by step guide to learn how to customize the color, font, and logo of your login form. Share your code on our Devpost Page!","link":"https://mlh.link/ghwos24-auth0-challenge4","completed":true},{"id":80,"title":"Tweet or post on Linkedin with a screenshot of your customized Login box","description":"Tag @auth0 and use the hashtag: #Auth0MLH-GHW. Share the link to your post in our submission form!","link":"https://mlh.link/ghwos24-auth0-challenge5","completed":true},{"id":81,"title":"Polyglot Development","description":"Start Polyglot Development with Autonomous Database. This LiveLab will demonstrate how to provision an Oracle Autonomous Database and developapplications in multiple programming languages. Submit a screenshot to the submission form!","link":"https://mlh.link/ghwos24-oracle-challenge1","completed":false},{"id":82,"title":"SQL, JSON, and MongoDB API","description":"SQL, JSON, and MongoDB API: Unify worlds with Oracle Database 23ai Free. In this LiveLab, you will experience Oracle's JSON capabilities using both relational anddocument-store APIs, namely the Oracle Database API for MongDB. Submit a screenshot to the submission form!","link":"https://mlh.link/ghwos24-oracle-challenge2","completed":false},{"id":83,"title":"Oracle Database + Micronaut","description":"Develop with Oracle Database 23ai and GraalVM using Micronaut. This LiveLab will walk you through the basics of developing with Oracle Database andGraalVM using Micronaut in order to get you up an running quickly with a data-drivenmicroservice that connects to Oracle’s famous Autonomous Database. Submit a screenshot to the submission form!","link":"https://mlh.link/ghwos24-oracle-challenge3","completed":false},{"id":84,"title":"Oracle Database + Spring Boot","description":"Develop with Oracle Database 23ai and GraalVM using Spring Boot. This LiveLab will walk you through the basics of developing with Oracle Database andGraalVM using Spring Boot in order to get you up an running quickly with a data-drivenmicroservice that connects to Oracle’s famous Autonomous Database. Submit a screenshot to the submission form!","link":"https://mlh.link/ghwos24-oracle-challenge4","completed":false},{"id":85,"title":"Oracle Database, GraalVM + Helidon","description":"Develop with Oracle Database 23ai and GraalVM using Helidon. This LiveLab will walk you through the basics of developing with Oracle Database andGraalVM using Helidon in order to get you up an running quickly with a data-drivenmicroservice that connects to Oracle’s famous Autonomous Database. Submit a screenshot to the submission form!","link":"https://mlh.link/ghwos24-oracle-challenge5","completed":false}]